# Pandas DataFrames. Selecting rows and cols. Exercise 3. Solution

Pandas documentation: https://pandas.pydata.org/docs/index.html

Pandas API reference: https://pandas.pydata.org/docs/reference/index.html#api

In [73]:
#import pandas library
import pandas as pd

### Dataset: Countries of the world
https://www.kaggle.com/datasets/fernandol/countries-of-the-world

More info about the dataset columns in kaggle.

*Note*: you can find the dataset in this repo: countries_of_the_world.csv

In [74]:
# Open the dataset from the local filesystem
df_countries = pd.read_csv(('../../data/countries_of_the_world.csv'))

In [75]:
df_countries

,Country,Region,Population,Area (sq. mi.),Pop. Density (per sq. mi.),Coastline (coast/area ratio),Net migration,Infant mortality (per 1000 births),GDP ($ per capita),Literacy (%),Phones (per 1000),Arable (%),Crops (%),Other (%),Climate,Birthrate,Deathrate,Agriculture,Industry,Service
0,Afghanistan,ASIA (EX. NEAR EAST),31056997,647500,"48,0","0,00","23,06","163,07",700.0,"36,0","3,2","12,13","0,22","87,65",1,"46,6","20,34","0,38","0,24","0,38"
1,Albania,EASTERN EUROPE,3581655,28748,"124,6","1,26","-4,93","21,52",4500.0,"86,5","71,2","21,09","4,42","74,49",3,"15,11","5,22","0,232","0,188","0,579"
2,Algeria,NORTHERN AFRICA,32930091,2381740,"13,8","0,04","-0,39",31,6000.0,"70,0","78,1","3,22","0,25","96,53",1,"17,14","4,61","0,101","0,6","0,298"
3,American Samoa,OCEANIA,57794,199,"290,4","58,29","-20,71","9,27",8000.0,"97,0","259,5",10,15,75,2,"22,46","3,27",NaN,NaN,NaN
4,Andorra,WESTERN EUROPE,71201,468,"152,1","0,00","6,6","4,05",19000.0,"100,0","497,2","2,22",0,"97,78",3,"8,71","6,25",NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
222,West Bank,NEAR EAST,2460492,5860,"419,9","0,00","2,98","19,62",800.0,NaN,"145,2","16,9","18,97","64,13",3,"31,67","3,92","0,09","0,28","0,63"
223,Western Sahara,NORTHERN AFRICA,273008,266000,"1,0","0,42",NaN,NaN,NaN,NaN,NaN,"0,02",0,"99,98",1,NaN,NaN,NaN,NaN,"0,4"
224,Yemen,NEAR EAST,21456188,527970,"40,6","0,36",0,"61,5",800.0,"50,2","37,2","2,78","0,24","96,98",1,"42,89","8,3","0,135","0,472","0,393"
225,Zambia,SUB-SAHARAN AFRICA,11502010,752614,"15,3","0,00",0,"88,29",800.0,"80,6","8,2","7,08","0,03","92,9",2,41,"19,93","0,22","0,29","0,489"
226,Zimbabwe,SUB-SAHARAN AFRICA,12236805,390580,"31,3","0,00",0,"67,69",1900.0,"90,7","26,8","8,32","0,34","91,34",2,"28,01","21,84","0,179","0,243","0,579"

In [76]:
# Select columns Country, Region and Population
df_countries[['Country','Region','Population']]

             Country                               Region  Population
0       Afghanistan         ASIA (EX. NEAR EAST)             31056997
1           Albania   EASTERN EUROPE                          3581655
2           Algeria   NORTHERN AFRICA                        32930091
3    American Samoa   OCEANIA                                   57794
4           Andorra   WESTERN EUROPE                            71201
..               ...                                  ...         ...
222       West Bank   NEAR EAST                               2460492
223  Western Sahara   NORTHERN AFRICA                          273008
224           Yemen   NEAR EAST                              21456188
225          Zambia   SUB-SAHARAN AFRICA                     11502010
226        Zimbabwe   SUB-SAHARAN AFRICA                     12236805

[227 rows x 3 columns]

In [77]:
# Select the 4 first rows of the dataframe, columns Country, Population and Area
df_countries[['Country','Population','Area (sq. mi.)']].head(4)

           Country  Population  Area (sq. mi.)
0     Afghanistan     31056997          647500
1         Albania      3581655           28748
2         Algeria     32930091         2381740
3  American Samoa        57794             199

In [78]:
df_countries[['Country','Population','Area (sq. mi.)']].iloc[0:4]

           Country  Population  Area (sq. mi.)
0     Afghanistan     31056997          647500
1         Albania      3581655           28748
2         Algeria     32930091         2381740
3  American Samoa        57794             199

In [79]:
# Show column names
df_countries.columns

Index(['Country', 'Region', 'Population', 'Area (sq. mi.)',
       'Pop. Density (per sq. mi.)', 'Coastline (coast/area ratio)',
       'Net migration', 'Infant mortality (per 1000 births)',
       'GDP ($ per capita)', 'Literacy (%)', 'Phones (per 1000)', 'Arable (%)',
       'Crops (%)', 'Other (%)', 'Climate', 'Birthrate', 'Deathrate',
       'Agriculture', 'Industry', 'Service'],
      dtype='object')

In [80]:
# Select the last 6 rows of the dataset, columns: country, literacy and Phones
df_countries[['Country','Literacy (%)','Phones (per 1000)']].tail(6)

                Country Literacy (%) Phones (per 1000)
221  Wallis and Futuna          50,0             118,6
222          West Bank           NaN             145,2
223     Western Sahara           NaN               NaN
224              Yemen          50,2              37,2
225             Zambia          80,6               8,2
226           Zimbabwe          90,7              26,8

In [81]:
df_countries[['Country','Literacy (%)','Phones (per 1000)']].iloc[-6:]

                Country Literacy (%) Phones (per 1000)
221  Wallis and Futuna          50,0             118,6
222          West Bank           NaN             145,2
223     Western Sahara           NaN               NaN
224              Yemen          50,2              37,2
225             Zambia          80,6               8,2
226           Zimbabwe          90,7              26,8

In [100]:
# Select the two first rows using loc or iloc
df_countries.iloc[0:2]

,Country,Region,Population,Area (sq. mi.),Pop. Density (per sq. mi.),Coastline (coast/area ratio),Net migration,Infant mortality (per 1000 births),GDP ($ per capita),Literacy (%),Phones (per 1000),Arable (%),Crops (%),Other (%),Climate,Birthrate,Deathrate,Agriculture,Industry,Service
0,Afghanistan,ASIA (EX. NEAR EAST),31056997,647500,"48,0","0,00","23,06","163,07",700.0,"36,0","3,2","12,13","0,22","87,65",1,"46,6","20,34","0,38","0,24","0,38"
1,Albania,EASTERN EUROPE,3581655,28748,"124,6","1,26","-4,93","21,52",4500.0,"86,5","71,2","21,09","4,42","74,49",3,"15,11","5,22","0,232","0,188","0,579"

In [84]:
# Select the fifth row
# df_countries.iloc[4] # as a Series
df_countries.iloc[[4]]

,Country,Region,Population,Area (sq. mi.),Pop. Density (per sq. mi.),Coastline (coast/area ratio),Net migration,Infant mortality (per 1000 births),GDP ($ per capita),Literacy (%),Phones (per 1000),Arable (%),Crops (%),Other (%),Climate,Birthrate,Deathrate,Agriculture,Industry,Service
4,Andorra,WESTERN EUROPE,71201,468,"152,1","0,00","6,6","4,05",19000.0,"100,0","497,2","2,22",0,"97,78",3,"8,71","6,25",NaN,NaN,NaN

In [85]:
print(df_countries.index.tolist())

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226]

In [86]:
# Save data about Albania in a new dataframe variable
# Then show the new dataframe
datos_albania = df_countries.iloc[[1]]
datos_albania

,Country,Region,Population,Area (sq. mi.),Pop. Density (per sq. mi.),Coastline (coast/area ratio),Net migration,Infant mortality (per 1000 births),GDP ($ per capita),Literacy (%),Phones (per 1000),Arable (%),Crops (%),Other (%),Climate,Birthrate,Deathrate,Agriculture,Industry,Service
1,Albania,EASTERN EUROPE,3581655,28748,"124,6","1,26","-4,93","21,52",4500.0,"86,5","71,2","21,09","4,42","74,49",3,"15,11","5,22","0,232","0,188","0,579"

In [87]:
# Create a new dataframe called datos_10_paises 
# columns: Country, Population and Climate 
# rows: the ten first ones
# Then show the new dataframe
datos_10_paises = df_countries[['Country','Population','Climate']].head(10)
datos_10_paises

              Country  Population Climate
0        Afghanistan     31056997       1
1            Albania      3581655       3
2            Algeria     32930091       1
3     American Samoa        57794       2
4            Andorra        71201       3
5             Angola     12127071     NaN
6           Anguilla        13477       2
7  Antigua & Barbuda        69108       2
8          Argentina     39921833       3
9            Armenia      2976372       4

In [102]:
# Load the dataframe again using country names as index
df_paises = pd.read_csv(('../../data/countries_of_the_world.csv'),index_col='Country')

In [103]:
# Show 5 random rows
df_paises.sample(5)

,Region,Population,Area (sq. mi.),Pop. Density (per sq. mi.),Coastline (coast/area ratio),Net migration,Infant mortality (per 1000 births),GDP ($ per capita),Literacy (%),Phones (per 1000),Arable (%),Crops (%),Other (%),Climate,Birthrate,Deathrate,Agriculture,Industry,Service
Country,,,,,,,,,,,,,,,,,,,
India,ASIA (EX. NEAR EAST),1095351995,3287590,"333,2","0,21","-0,07","56,29",2900.0,"59,5","45,4","54,4","2,74","42,86","2,5","22,01","8,18","0,186","0,276","0,538"
Malaysia,ASIA (EX. NEAR EAST),24385858,329750,"74,0","1,42",0,"17,7",9000.0,"88,7","179,0","5,48","17,61","76,91",2,"22,86","5,05","0,084","0,48","0,436"
Honduras,LATIN AMER. & CARIB,7326496,112090,"65,4","0,73","-1,99","29,32",2600.0,"76,2","67,5","9,55","3,22","87,23",2,"28,24","5,28","0,139","0,312","0,549"
Zambia,SUB-SAHARAN AFRICA,11502010,752614,"15,3","0,00",0,"88,29",800.0,"80,6","8,2","7,08","0,03","92,9",2,41,"19,93","0,22","0,29","0,489"
Marshall Islands,OCEANIA,60422,11854,"5,1","3,12","-6,04","29,45",1600.0,"93,7","91,2","16,67","38,89","44,44",2,"33,05","4,78","0,317","0,149","0,534"

In [ ]:
df_paises.info()

<class 'pandas.core.frame.DataFrame'>
Index: 227 entries, Afghanistan  to Zimbabwe
Data columns (total 19 columns):
 #   Column                              Non-Null Count  Dtype
---  ------                              --------------  -----
 0   Region                              227 non-null    object
 1   Population                          227 non-null    int64
 2   Area (sq. mi.)                      227 non-null    int64
 3   Pop. Density (per sq. mi.)          227 non-null    object
 4   Coastline (coast/area ratio)        227 non-null    object
 5   Net migration                       224 non-null    object
 6   Infant mortality (per 1000 births)  224 non-null    object
 7   GDP ($ per capita)                  226 non-null    float64
 8   Literacy (%)                        209 non-null    object
 9   Phones (per 1000)                   223 non-null    object
 10  Arable (%)                          225 non-null    object
 11  Crops (%)                           225 non-null    object
 12  Other (%)                           225 non-null    object
 13  Climate                             205 non-null    object
 14  Birthrate                           224 non-null    object
 15  Deathrate                           223 non-null    object
 16  Agriculture                         212 non-null    object
 17  Industry                            211 non-null    object
 18  Service                             212 non-null    object
dtypes: float64(1), int64(2), object(16)
memory usage: 35.5+ KB

In [ ]:
# Show data about France (use indexes)
df_paises.loc[['France ']]

# Note: If you have problems with indexes, take a look to the CSV file directly ;-)

,Region,Population,Area (sq. mi.),Pop. Density (per sq. mi.),Coastline (coast/area ratio),Net migration,Infant mortality (per 1000 births),GDP ($ per capita),Literacy (%),Phones (per 1000),Arable (%),Crops (%),Other (%),Climate,Birthrate,Deathrate,Agriculture,Industry,Service
Country,,,,,,,,,,,,,,,,,,,
France,WESTERN EUROPE,60876136,547030,"111,3","0,63","0,66","4,26",27600.0,"99,0","586,4","33,53","2,07","64,4",4,"11,99","9,14","0,022","0,214","0,764"

In [ ]:
# Create a new dataframe with data about Spain
# Columns: Population, Area, Climate, Birthrate and Deathrate
df_spain = df_paises.loc[['Spain ']][['Population','Area (sq. mi.)','Climate','Birthrate','Deathrate']]
df_spain

         Population  Area (sq. mi.) Climate Birthrate Deathrate
Country
Spain      40397842          504782       3     10,06      9,72

In [ ]:
# Select all data from these countries: France, Germany and Spain
df_paises.loc[['France ','Germany ','Spain ']]

,Region,Population,Area (sq. mi.),Pop. Density (per sq. mi.),Coastline (coast/area ratio),Net migration,Infant mortality (per 1000 births),GDP ($ per capita),Literacy (%),Phones (per 1000),Arable (%),Crops (%),Other (%),Climate,Birthrate,Deathrate,Agriculture,Industry,Service
Country,,,,,,,,,,,,,,,,,,,
France,WESTERN EUROPE,60876136,547030,"111,3","0,63","0,66","4,26",27600.0,"99,0","586,4","33,53","2,07","64,4",4,"11,99","9,14","0,022","0,214","0,764"
Germany,WESTERN EUROPE,82422299,357021,"230,9","0,67","2,18","4,16",27600.0,"99,0","667,9","33,85","0,59","65,56",3,"8,25","10,62","0,009","0,296","0,695"
Spain,WESTERN EUROPE,40397842,504782,"80,0","0,98","0,99","4,42",22000.0,"97,9","453,5","26,07","9,87","64,06",3,"10,06","9,72","0,04","0,295","0,665"

In [ ]:
# Select a range of rows
# Select rows from 10 to 20 (not included)
df_countries.iloc[10:20]

,Country,Region,Population,Area (sq. mi.),Pop. Density (per sq. mi.),Coastline (coast/area ratio),Net migration,Infant mortality (per 1000 births),GDP ($ per capita),Literacy (%),Phones (per 1000),Arable (%),Crops (%),Other (%),Climate,Birthrate,Deathrate,Agriculture,Industry,Service
10,Aruba,LATIN AMER. & CARIB,71891,193,"372,5","35,49",0,"5,89",28000.0,"97,0","516,1","10,53",0,"89,47",2,"11,03","6,68","0,004","0,333","0,663"
11,Australia,OCEANIA,20264082,7686850,"2,6","0,34","3,98","4,69",29000.0,"100,0","565,5","6,55","0,04","93,41",1,"12,14","7,51","0,038","0,262","0,7"
12,Austria,WESTERN EUROPE,8192880,83870,"97,7","0,00",2,"4,66",30000.0,"98,0","452,2","16,91","0,86","82,23",3,"8,74","9,76","0,018","0,304","0,678"
13,Azerbaijan,C.W. OF IND. STATES,7961619,86600,"91,9","0,00","-4,9","81,74",3400.0,"97,0","137,1","19,63","2,71","77,66",1,"20,74","9,75","0,141","0,457","0,402"
14,"Bahamas, The",LATIN AMER. & CARIB,303770,13940,"21,8","25,41","-2,2","25,21",16700.0,"95,6","460,6","0,8","0,4","98,8",2,"17,57","9,05","0,03","0,07","0,9"
15,Bahrain,NEAR EAST,698585,665,"1050,5","24,21","1,05","17,27",16900.0,"89,1","281,3","2,82","5,63","91,55",1,"17,8","4,14","0,005","0,387","0,608"
16,Bangladesh,ASIA (EX. NEAR EAST),147365352,144000,"1023,4","0,40","-0,71","62,6",1900.0,"43,1","7,3","62,11","3,07","34,82",2,"29,8","8,27","0,199","0,198","0,603"
17,Barbados,LATIN AMER. & CARIB,279912,431,"649,5","22,51","-0,31","12,5",15700.0,"97,4","481,9","37,21","2,33","60,46",2,"12,71","8,67","0,06","0,16","0,78"
18,Belarus,C.W. OF IND. STATES,10293011,207600,"49,6","0,00","2,54","13,37",6100.0,"99,6","319,1","29,55","0,6","69,85",4,"11,16","14,02","0,093","0,316","0,591"
19,Belgium,WESTERN EUROPE,10379067,30528,"340,0","0,22","1,23","4,68",29100.0,"98,0","462,6","23,28","0,4","76,32",3,"10,38","10,27","0,01","0,24","0,749"

In [ ]:
# Select rows from Spain to Uruguay
# Show only Population and Density columns
df_paises.loc['Spain ':'Uruguay '][['Population','Pop. Density (per sq. mi.)']]

                       Population Pop. Density (per sq. mi.)
Country
Spain                    40397842                       80,0
Sri Lanka                20222240                      308,2
Sudan                    41236378                       16,5
Suriname                   439117                        2,7
Swaziland                 1136334                       65,5
Sweden                    9016596                       20,0
Switzerland               7523934                      182,2
Syria                    18881361                      102,0
Taiwan                   23036087                      640,3
Tajikistan                7320815                       51,2
Tanzania                 37445392                       39,6
Thailand                 64631595                      125,7
Togo                      5548702                       97,7
Tonga                      114689                      153,3
Trinidad & Tobago         1065842                      207,9
Tunisia                  10175014                       62,2
Turkey                   70413958                       90,2
Turkmenistan              5042920                       10,3
Turks & Caicos Is           21152                       49,2
Tuvalu                      11810                      454,2
Uganda                   28195754                      119,5
Ukraine                  46710816                       77,4
United Arab Emirates      2602713                       31,4
United Kingdom           60609153                      247,6
United States           298444215                       31,0
Uruguay                   3431932                       19,5